"1 223 1 4206624772 ,"
"input 4 1 3 64 64 0 ,"
" 164 165 167 169 170 171 173 174 175 176 178 179 180 182 184 185 186 187 188 190 191 192 194 195 196 197 198 200 201 202 204 205 206 208 210 211 212 213 214 216 217 218 220 221 222 223 224 225 226 228 229 230 232 233 234 235 236 238 239 240 242 243 244 245 246 247 255 256 257 265 266 267 275 276 277 278 288 289 290 300 301 302 312 313 314 324 325 326 327 343 350 357 358 359 360 361 362 364 365 367 368 370 371 372 373 374 375 376 378 379 399 402 403 405 406 407 408 410 411 412 413 414 415 418 419 420 423 424 426 427 428 429 431 432 433 437 442 443 448 449 454 455 456 457 458 459 460 461 462 463 473 474 475 476 477 478 479 480 481 482 492 493 494 495 496 497 498 499 500 501 511 513 515 516 518 519 520 522 524 525 526 528 530 531 533 535 536 538 539 540 542 544 545 546 548 550 551 553 555 556 558 560 561 563 564 565 567 569 570 571 573 575 576 578 580 581 583 585 586 587 588 input output ,"
"output ,"
" 222 ,"
"Convolution Conv_0 1 1 input 164 3 1 3 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_1 1 1 164 165 1 3 16 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_3 1 1 165 167 ,"
"Pooling AveragePool_5 1 1 167 169 1 2 2 2 2 0 0 -1 -1 -1 0 0 0 0 ,"
"Convolution Conv_6 1 1 input 170 3 1 3 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_7 1 1 170 171 1 3 16 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_9 1 1 171 173 ,"
"Pooling MaxPool_10 1 1 173 174 0 2 2 2 2 0 0 -1 -1 -1 0 0 0 0 ,"
"Convolution Conv_11 1 1 169 175 16 1 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_12 1 1 175 176 1 16 32 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_14 1 1 176 178 ,"
"Convolution Conv_15 1 1 178 179 32 1 32 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_16 1 1 179 180 1 32 32 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_18 1 1 180 182 ,"
"Pooling AveragePool_20 1 1 182 184 1 2 2 2 2 0 0 -1 -1 -1 0 0 0 0 ,"
"Convolution Conv_21 1 1 184 185 1 32 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_22 1 1 185 186 ,"
"Convolution Conv_23 1 1 174 187 16 1 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_24 1 1 187 188 1 16 32 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Tanh Tanh_26 1 1 188 190 ,"
"Convolution Conv_27 1 1 190 191 32 1 32 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_28 1 1 191 192 1 32 32 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Tanh Tanh_30 1 1 192 194 ,"
"Pooling MaxPool_31 1 1 194 195 0 2 2 2 2 0 0 -1 -1 -1 0 0 0 0 ,"
"Convolution Conv_32 1 1 195 196 1 32 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Tanh Tanh_33 1 1 196 197 ,"
"Mul Mul_34 2 1 186 197 198 1 ,"
"Pooling AveragePool_36 1 1 198 200 1 2 2 2 2 0 0 -1 -1 -1 0 0 0 0 ,"
"Convolution Conv_37 1 1 184 201 32 1 32 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_38 1 1 201 202 1 32 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_40 1 1 202 204 ,"
"Convolution Conv_41 1 1 204 205 64 1 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_42 1 1 205 206 1 64 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_44 1 1 206 208 ,"
"Pooling AveragePool_46 1 1 208 210 1 2 2 2 2 0 0 -1 -1 -1 0 0 0 0 ,"
"Convolution Conv_47 1 1 210 211 1 64 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_48 1 1 211 212 ,"
"Convolution Conv_49 1 1 195 213 32 1 32 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_50 1 1 213 214 1 32 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Tanh Tanh_52 1 1 214 216 ,"
"Convolution Conv_53 1 1 216 217 64 1 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_54 1 1 217 218 1 64 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Tanh Tanh_56 1 1 218 220 ,"
"Pooling MaxPool_57 1 1 220 221 0 2 2 2 2 0 0 -1 -1 -1 0 0 0 0 ,"
"Convolution Conv_58 1 1 221 222 1 64 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Tanh Tanh_59 1 1 222 223 ,"
"Mul Mul_60 2 1 212 223 224 1 ,"
"Convolution Conv_61 1 1 210 225 64 1 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_62 1 1 225 226 1 64 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_64 1 1 226 228 ,"
"Convolution Conv_65 1 1 228 229 128 1 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_66 1 1 229 230 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_68 1 1 230 232 ,"
"Convolution Conv_69 1 1 232 233 1 128 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_70 1 1 233 234 ,"
"Convolution Conv_71 1 1 221 235 64 1 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_72 1 1 235 236 1 64 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Tanh Tanh_74 1 1 236 238 ,"
"Convolution Conv_75 1 1 238 239 128 1 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_76 1 1 239 240 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Tanh Tanh_78 1 1 240 242 ,"
"Convolution Conv_79 1 1 242 243 1 128 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Tanh Tanh_80 1 1 243 244 ,"
"Mul Mul_81 2 1 234 244 245 1 ,"
"Convolution Conv_82 1 1 245 246 1 64 1 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_83 1 1 246 247 ,"
"Reshape Reshape_89 1 1 247 255 0 2 2 0 -1 0 ,"
"Convolution Conv_90 1 1 224 256 1 64 1 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_91 1 1 256 257 ,"
"Reshape Reshape_97 1 1 257 265 0 2 2 0 -1 0 ,"
"Convolution Conv_98 1 1 200 266 1 64 1 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_99 1 1 266 267 ,"
"Reshape Reshape_105 1 1 267 275 0 2 2 0 -1 0 ,"
"Concat Concat_106 3 1 255 265 275 276 1 ,"
"InnerProduct Gemm_107 1 1 276 277 35 1 0 1 ,"
"Sigmoid Sigmoid_108 1 1 277 278 ,"
"Reshape Reshape_114 1 1 278 288 0 3 3 0 7 5 0 ,"
"InnerProduct Gemm_115 1 1 255 289 960 1 0 1 ,"
"Sigmoid Sigmoid_116 1 1 289 290 ,"
"Reshape Reshape_122 1 1 290 300 0 3 3 0 5 192 0 ,"
"InnerProduct Gemm_123 1 1 265 301 960 1 0 1 ,"
"Sigmoid Sigmoid_124 1 1 301 302 ,"
"Reshape Reshape_130 1 1 302 312 0 3 3 0 5 192 0 ,"
"InnerProduct Gemm_131 1 1 275 313 960 1 0 1 ,"
"Sigmoid Sigmoid_132 1 1 313 314 ,"
"Reshape Reshape_138 1 1 314 324 0 3 3 0 5 192 0 ,"
"MatMul MatMul_139 2 1 288 300 325 -1 ,"
"MatMul MatMul_140 2 1 288 312 326 -1 ,"
"MatMul MatMul_141 2 1 288 324 327 -1 ,"
"Reshape Reshape_155 1 1 245 343 0 3 3 -1 0 64 0 ,"
"Reshape Reshape_160 1 1 224 350 0 3 3 -1 0 64 0 ,"
"Reshape Reshape_165 1 1 200 357 0 3 3 -1 0 64 0 ,"
"Concat Concat_166 3 1 343 350 357 358 1 ,"
"MatMul MatMul_167 2 1 325 358 359 -1 ,"
"MatMul MatMul_168 2 1 326 358 360 -1 ,"
"MatMul MatMul_169 2 1 327 358 361 -1 ,"
"ReduceSum ReduceSum_170 1 1 325 362 1 2 ,"
"Add Add_172 1 1 362 364 1 ,"
"ReduceSum ReduceSum_173 1 1 326 365 1 2 ,"
"Add Add_175 1 1 365 367 1 ,"
"ReduceSum ReduceSum_176 1 1 327 368 1 2 ,"
"Add Add_178 1 1 368 370 1 ,"
"Div Div_179 2 1 359 364 371 1 ,"
"Div Div_180 2 1 360 367 372 1 ,"
"Div Div_181 2 1 361 370 373 1 ,"
"Concat Concat_182 3 1 371 372 373 374 1 ,"
"Unsqueeze Unsqueeze_183 1 1 374 375 1 1 ,"
"Unsqueeze Unsqueeze_184 1 1 375 376 1 3 ,"
"MatMul MatMul_185 1 1 376 378 1 ,"
"Squeeze Squeeze_186 1 1 378 379 1 3 ,"
"MatMul MatMul_206 1 1 379 399 0 ,"
"Power Pow_207 1 1 399 402 2 1 0 ,"
"ReduceSum ReduceSum_208 1 1 402 403 1 3 ,"
"Add Add_210 1 1 403 405 1 ,"
"Div Div_211 2 1 403 405 406 1 ,"
"Mul Mul_212 2 1 406 399 407 1 ,"
"Sqrt Sqrt_213 1 1 403 408 ,"
"Add Add_215 1 1 408 410 1 ,"
"Div Div_216 2 1 407 410 411 1 ,"
"Permute Transpose_217 1 1 411 412 4 0 1 3 2 ,"
"MatMul MatMul_218 2 1 379 412 413 -1 ,"
"Squeeze Squeeze_219 1 1 413 414 1 3 ,"
"Add Add_220 1 1 414 415 0 ,"
"SoftmaxCaffe Exp_221 1 1 415 418 1 ,"
"Unsqueeze Unsqueeze_224 1 1 418 419 1 2 ,"
"MatMul MatMul_225 2 1 419 379 420 -1 ,"
"Power Pow_226 1 1 420 423 2 1 0 ,"
"ReduceSum ReduceSum_227 1 1 423 424 1 3 ,"
"Add Add_229 1 1 424 426 1 ,"
"Div Div_230 2 1 424 426 427 1 ,"
"Mul Mul_231 2 1 427 420 428 1 ,"
"Sqrt Sqrt_232 1 1 424 429 ,"
"Add Add_234 1 1 429 431 1 ,"
"Div Div_235 2 1 428 431 432 1 ,"
"Squeeze Squeeze_236 1 1 432 433 1 2 ,"
"StridedSliceV2 Slice_240 1 1 433 437 1 0 1 1 1 1 1 1 ,"
"Reshape Reshape_243 1 1 437 442 0 2 2 0 -1 0 ,"
"StridedSliceV2 Slice_244 1 1 433 443 1 1 1 2 1 1 1 1 ,"
"Reshape Reshape_247 1 1 443 448 0 2 2 0 -1 0 ,"
"StridedSliceV2 Slice_248 1 1 433 449 1 2 1 3 1 1 1 1 ,"
"Reshape Reshape_251 1 1 449 454 0 2 2 0 -1 0 ,"
"StridedSliceV2 Slice_252 1 1 442 455 1 0 1 4 1 1 1 1 ,"
"InnerProduct Gemm_253 1 1 455 456 3 1 0 1 ,"
"Tanh Tanh_254 1 1 456 457 ,"
"StridedSliceV2 Slice_255 1 1 442 458 1 4 1 8 1 1 1 1 ,"
"InnerProduct Gemm_256 1 1 458 459 3 1 0 1 ,"
"Tanh Tanh_257 1 1 459 460 ,"
"StridedSliceV2 Slice_258 1 1 442 461 1 8 1 2147483647 1 1 1 1 ,"
"InnerProduct Gemm_259 1 1 461 462 9 1 0 1 ,"
"ReLU Relu_260 1 1 462 463 ,"
"Reshape Reshape_266 1 1 463 473 0 3 3 0 3 3 0 ,"
"StridedSliceV2 Slice_267 1 1 448 474 1 0 1 4 1 1 1 1 ,"
"InnerProduct Gemm_268 1 1 474 475 3 1 0 1 ,"
"Tanh Tanh_269 1 1 475 476 ,"
"StridedSliceV2 Slice_270 1 1 448 477 1 4 1 8 1 1 1 1 ,"
"InnerProduct Gemm_271 1 1 477 478 3 1 0 1 ,"
"Tanh Tanh_272 1 1 478 479 ,"
"StridedSliceV2 Slice_273 1 1 448 480 1 8 1 2147483647 1 1 1 1 ,"
"InnerProduct Gemm_274 1 1 480 481 9 1 0 1 ,"
"ReLU Relu_275 1 1 481 482 ,"
"Reshape Reshape_281 1 1 482 492 0 3 3 0 3 3 0 ,"
"StridedSliceV2 Slice_282 1 1 454 493 1 0 1 4 1 1 1 1 ,"
"InnerProduct Gemm_283 1 1 493 494 3 1 0 1 ,"
"Tanh Tanh_284 1 1 494 495 ,"
"StridedSliceV2 Slice_285 1 1 454 496 1 4 1 8 1 1 1 1 ,"
"InnerProduct Gemm_286 1 1 496 497 3 1 0 1 ,"
"Tanh Tanh_287 1 1 497 498 ,"
"StridedSliceV2 Slice_288 1 1 454 499 1 8 1 2147483647 1 1 1 1 ,"
"InnerProduct Gemm_289 1 1 499 500 9 1 0 1 ,"
"ReLU Relu_290 1 1 500 501 ,"
"Reshape Reshape_296 1 1 501 511 0 3 3 0 3 3 0 ,"
"Add Add_298 1 1 457 513 1 ,"
"Gather Gather_300 1 1 473 515 2 0 1 ,"
"Mul Mul_301 2 1 513 515 516 1 ,"
"Gather Gather_303 1 1 473 518 2 0 1 ,"
"Mul Mul_304 2 1 457 518 519 1 ,"
"Add Add_305 2 1 516 519 520 1 ,"
"Add Add_307 1 1 457 522 1 ,"
"Gather Gather_309 1 1 473 524 2 0 1 ,"
"Mul Mul_310 2 1 522 524 525 1 ,"
"Add Add_311 2 1 520 525 526 1 ,"
"Add Add_313 1 1 460 528 1 ,"
"Mul Mul_315 1 1 528 530 1 ,"
"Div Div_316 2 1 526 530 531 1 ,"
"Add Add_318 1 1 476 533 1 ,"
"Gather Gather_320 1 1 492 535 2 0 1 ,"
"Mul Mul_321 2 1 533 535 536 1 ,"
"Gather Gather_323 1 1 492 538 2 0 1 ,"
"Mul Mul_324 2 1 476 538 539 1 ,"
"Add Add_325 2 1 536 539 540 1 ,"
"Add Add_327 1 1 476 542 1 ,"
"Gather Gather_329 1 1 492 544 2 0 1 ,"
"Mul Mul_330 2 1 542 544 545 1 ,"
"Add Add_331 2 1 540 545 546 1 ,"
"Add Add_333 1 1 460 548 1 ,"
"Mul Mul_335 1 1 548 550 1 ,"
"Div Div_336 2 1 546 550 551 1 ,"
"Add Add_338 1 1 479 553 1 ,"
"Mul Mul_340 1 1 553 555 1 ,"
"Div Div_341 2 1 551 555 556 1 ,"
"Add Add_343 1 1 495 558 1 ,"
"Gather Gather_345 1 1 511 560 2 0 1 ,"
"Mul Mul_346 2 1 558 560 561 1 ,"
"Gather Gather_348 1 1 511 563 2 0 1 ,"
"Mul Mul_349 2 1 495 563 564 1 ,"
"Add Add_350 2 1 561 564 565 1 ,"
"Add Add_352 1 1 495 567 1 ,"
"Gather Gather_354 1 1 511 569 2 0 1 ,"
"Mul Mul_355 2 1 567 569 570 1 ,"
"Add Add_356 2 1 565 570 571 1 ,"
"Add Add_358 1 1 460 573 1 ,"
"Mul Mul_360 1 1 573 575 1 ,"
"Div Div_361 2 1 571 575 576 1 ,"
"Add Add_363 1 1 479 578 1 ,"
"Mul Mul_365 1 1 578 580 1 ,"
"Div Div_366 2 1 576 580 581 1 ,"
"Add Add_368 1 1 498 583 1 ,"
"Mul Mul_370 1 1 583 585 1 ,"
"Div Div_371 2 1 581 585 586 1 ,"
"Add Add_372 2 1 531 556 587 1 ,"
"Add Add_373 2 1 587 586 588 1 ,"
"Mul Mul_375 1 1 588 output 1 ,"
