"1 229 1 4206624772 ,"
"input 4 1 3 64 64 0 ,"
" 162 163 165 167 168 169 171 172 173 174 176 177 178 180 182 183 184 185 186 188 189 190 192 193 194 195 196 198 199 200 202 203 204 206 208 209 210 211 212 214 215 216 218 219 220 221 222 223 224 226 227 228 230 231 232 233 234 236 237 238 240 241 242 243 244 245 246 247 255 256 257 258 259 267 268 269 270 271 279 280 281 282 292 293 294 304 305 306 316 317 318 328 329 330 331 347 354 361 362 363 364 365 366 368 369 371 372 374 375 376 377 378 379 380 382 383 403 406 407 409 410 411 412 414 415 416 417 418 419 422 423 424 427 428 430 431 432 433 435 436 437 441 446 447 452 453 458 459 460 461 462 463 464 465 466 467 477 478 479 480 481 482 483 484 485 486 496 497 498 499 500 501 502 503 504 505 515 517 519 520 522 523 524 526 528 529 530 532 534 535 537 539 540 542 543 544 546 548 549 550 552 554 555 557 559 560 562 564 565 567 568 569 571 573 574 575 577 579 580 582 584 585 587 589 590 591 592 input output ,"
"output ,"
" 228 ,"
"Convolution Conv_0 1 1 input 162 3 1 3 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_1 1 1 162 163 1 3 16 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_3 1 1 163 165 ,"
"Pooling AveragePool_5 1 1 165 167 1 2 2 2 2 0 0 -1 -1 -1 0 0 0 0 ,"
"Convolution Conv_6 1 1 input 168 3 1 3 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_7 1 1 168 169 1 3 16 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_9 1 1 169 171 ,"
"Pooling MaxPool_10 1 1 171 172 0 2 2 2 2 0 0 -1 -1 -1 0 0 0 0 ,"
"Convolution Conv_11 1 1 167 173 16 1 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_12 1 1 173 174 1 16 32 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_14 1 1 174 176 ,"
"Convolution Conv_15 1 1 176 177 32 1 32 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_16 1 1 177 178 1 32 32 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_18 1 1 178 180 ,"
"Pooling AveragePool_20 1 1 180 182 1 2 2 2 2 0 0 -1 -1 -1 0 0 0 0 ,"
"Convolution Conv_21 1 1 182 183 1 32 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_22 1 1 183 184 ,"
"Convolution Conv_23 1 1 172 185 16 1 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_24 1 1 185 186 1 16 32 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Tanh Tanh_26 1 1 186 188 ,"
"Convolution Conv_27 1 1 188 189 32 1 32 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_28 1 1 189 190 1 32 32 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Tanh Tanh_30 1 1 190 192 ,"
"Pooling MaxPool_31 1 1 192 193 0 2 2 2 2 0 0 -1 -1 -1 0 0 0 0 ,"
"Convolution Conv_32 1 1 193 194 1 32 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Tanh Tanh_33 1 1 194 195 ,"
"Mul Mul_34 2 1 184 195 196 1 ,"
"Pooling AveragePool_36 1 1 196 198 1 2 2 2 2 0 0 -1 -1 -1 0 0 0 0 ,"
"Convolution Conv_37 1 1 182 199 32 1 32 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_38 1 1 199 200 1 32 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_40 1 1 200 202 ,"
"Convolution Conv_41 1 1 202 203 64 1 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_42 1 1 203 204 1 64 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_44 1 1 204 206 ,"
"Pooling AveragePool_46 1 1 206 208 1 2 2 2 2 0 0 -1 -1 -1 0 0 0 0 ,"
"Convolution Conv_47 1 1 208 209 1 64 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_48 1 1 209 210 ,"
"Convolution Conv_49 1 1 193 211 32 1 32 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_50 1 1 211 212 1 32 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Tanh Tanh_52 1 1 212 214 ,"
"Convolution Conv_53 1 1 214 215 64 1 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_54 1 1 215 216 1 64 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Tanh Tanh_56 1 1 216 218 ,"
"Pooling MaxPool_57 1 1 218 219 0 2 2 2 2 0 0 -1 -1 -1 0 0 0 0 ,"
"Convolution Conv_58 1 1 219 220 1 64 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Tanh Tanh_59 1 1 220 221 ,"
"Mul Mul_60 2 1 210 221 222 1 ,"
"Convolution Conv_61 1 1 208 223 64 1 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_62 1 1 223 224 1 64 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_64 1 1 224 226 ,"
"Convolution Conv_65 1 1 226 227 128 1 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_66 1 1 227 228 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_68 1 1 228 230 ,"
"Convolution Conv_69 1 1 230 231 1 128 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_70 1 1 231 232 ,"
"Convolution Conv_71 1 1 219 233 64 1 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_72 1 1 233 234 1 64 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Tanh Tanh_74 1 1 234 236 ,"
"Convolution Conv_75 1 1 236 237 128 1 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_76 1 1 237 238 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Tanh Tanh_78 1 1 238 240 ,"
"Convolution Conv_79 1 1 240 241 1 128 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Tanh Tanh_80 1 1 241 242 ,"
"Mul Mul_81 2 1 232 242 243 1 ,"
"ReduceMean ReduceMean_82 1 1 243 244 1 1 ,"
"Sub Sub_83 2 1 243 244 245 1 ,"
"Mul Mul_84 2 1 245 245 246 1 ,"
"ReduceMean ReduceMean_85 1 1 246 247 1 1 ,"
"Reshape Reshape_91 1 1 247 255 0 2 2 0 -1 0 ,"
"ReduceMean ReduceMean_92 1 1 222 256 1 1 ,"
"Sub Sub_93 2 1 222 256 257 1 ,"
"Mul Mul_94 2 1 257 257 258 1 ,"
"ReduceMean ReduceMean_95 1 1 258 259 1 1 ,"
"Reshape Reshape_101 1 1 259 267 0 2 2 0 -1 0 ,"
"ReduceMean ReduceMean_102 1 1 198 268 1 1 ,"
"Sub Sub_103 2 1 198 268 269 1 ,"
"Mul Mul_104 2 1 269 269 270 1 ,"
"ReduceMean ReduceMean_105 1 1 270 271 1 1 ,"
"Reshape Reshape_111 1 1 271 279 0 2 2 0 -1 0 ,"
"Concat Concat_112 3 1 255 267 279 280 1 ,"
"InnerProduct Gemm_113 1 1 280 281 35 1 0 1 ,"
"Sigmoid Sigmoid_114 1 1 281 282 ,"
"Reshape Reshape_120 1 1 282 292 0 3 3 0 7 5 0 ,"
"InnerProduct Gemm_121 1 1 255 293 960 1 0 1 ,"
"Sigmoid Sigmoid_122 1 1 293 294 ,"
"Reshape Reshape_128 1 1 294 304 0 3 3 0 5 192 0 ,"
"InnerProduct Gemm_129 1 1 267 305 960 1 0 1 ,"
"Sigmoid Sigmoid_130 1 1 305 306 ,"
"Reshape Reshape_136 1 1 306 316 0 3 3 0 5 192 0 ,"
"InnerProduct Gemm_137 1 1 279 317 960 1 0 1 ,"
"Sigmoid Sigmoid_138 1 1 317 318 ,"
"Reshape Reshape_144 1 1 318 328 0 3 3 0 5 192 0 ,"
"MatMul MatMul_145 2 1 292 304 329 -1 ,"
"MatMul MatMul_146 2 1 292 316 330 -1 ,"
"MatMul MatMul_147 2 1 292 328 331 -1 ,"
"Reshape Reshape_161 1 1 243 347 0 3 3 -1 0 64 0 ,"
"Reshape Reshape_166 1 1 222 354 0 3 3 -1 0 64 0 ,"
"Reshape Reshape_171 1 1 198 361 0 3 3 -1 0 64 0 ,"
"Concat Concat_172 3 1 347 354 361 362 1 ,"
"MatMul MatMul_173 2 1 329 362 363 -1 ,"
"MatMul MatMul_174 2 1 330 362 364 -1 ,"
"MatMul MatMul_175 2 1 331 362 365 -1 ,"
"ReduceSum ReduceSum_176 1 1 329 366 1 2 ,"
"Add Add_178 1 1 366 368 1 ,"
"ReduceSum ReduceSum_179 1 1 330 369 1 2 ,"
"Add Add_181 1 1 369 371 1 ,"
"ReduceSum ReduceSum_182 1 1 331 372 1 2 ,"
"Add Add_184 1 1 372 374 1 ,"
"Div Div_185 2 1 363 368 375 1 ,"
"Div Div_186 2 1 364 371 376 1 ,"
"Div Div_187 2 1 365 374 377 1 ,"
"Concat Concat_188 3 1 375 376 377 378 1 ,"
"Unsqueeze Unsqueeze_189 1 1 378 379 1 1 ,"
"Unsqueeze Unsqueeze_190 1 1 379 380 1 3 ,"
"MatMul MatMul_191 1 1 380 382 1 ,"
"Squeeze Squeeze_192 1 1 382 383 1 3 ,"
"MatMul MatMul_212 1 1 383 403 0 ,"
"Power Pow_213 1 1 403 406 2 1 0 ,"
"ReduceSum ReduceSum_214 1 1 406 407 1 3 ,"
"Add Add_216 1 1 407 409 1 ,"
"Div Div_217 2 1 407 409 410 1 ,"
"Mul Mul_218 2 1 410 403 411 1 ,"
"Sqrt Sqrt_219 1 1 407 412 ,"
"Add Add_221 1 1 412 414 1 ,"
"Div Div_222 2 1 411 414 415 1 ,"
"Permute Transpose_223 1 1 415 416 4 0 1 3 2 ,"
"MatMul MatMul_224 2 1 383 416 417 -1 ,"
"Squeeze Squeeze_225 1 1 417 418 1 3 ,"
"Add Add_226 1 1 418 419 0 ,"
"SoftmaxCaffe Exp_227 1 1 419 422 1 ,"
"Unsqueeze Unsqueeze_230 1 1 422 423 1 2 ,"
"MatMul MatMul_231 2 1 423 383 424 -1 ,"
"Power Pow_232 1 1 424 427 2 1 0 ,"
"ReduceSum ReduceSum_233 1 1 427 428 1 3 ,"
"Add Add_235 1 1 428 430 1 ,"
"Div Div_236 2 1 428 430 431 1 ,"
"Mul Mul_237 2 1 431 424 432 1 ,"
"Sqrt Sqrt_238 1 1 428 433 ,"
"Add Add_240 1 1 433 435 1 ,"
"Div Div_241 2 1 432 435 436 1 ,"
"Squeeze Squeeze_242 1 1 436 437 1 2 ,"
"StridedSliceV2 Slice_246 1 1 437 441 1 0 1 1 1 1 1 1 ,"
"Reshape Reshape_249 1 1 441 446 0 2 2 0 -1 0 ,"
"StridedSliceV2 Slice_250 1 1 437 447 1 1 1 2 1 1 1 1 ,"
"Reshape Reshape_253 1 1 447 452 0 2 2 0 -1 0 ,"
"StridedSliceV2 Slice_254 1 1 437 453 1 2 1 3 1 1 1 1 ,"
"Reshape Reshape_257 1 1 453 458 0 2 2 0 -1 0 ,"
"StridedSliceV2 Slice_258 1 1 446 459 1 0 1 4 1 1 1 1 ,"
"InnerProduct Gemm_259 1 1 459 460 3 1 0 1 ,"
"Tanh Tanh_260 1 1 460 461 ,"
"StridedSliceV2 Slice_261 1 1 446 462 1 4 1 8 1 1 1 1 ,"
"InnerProduct Gemm_262 1 1 462 463 3 1 0 1 ,"
"Tanh Tanh_263 1 1 463 464 ,"
"StridedSliceV2 Slice_264 1 1 446 465 1 8 1 2147483647 1 1 1 1 ,"
"InnerProduct Gemm_265 1 1 465 466 9 1 0 1 ,"
"ReLU Relu_266 1 1 466 467 ,"
"Reshape Reshape_272 1 1 467 477 0 3 3 0 3 3 0 ,"
"StridedSliceV2 Slice_273 1 1 452 478 1 0 1 4 1 1 1 1 ,"
"InnerProduct Gemm_274 1 1 478 479 3 1 0 1 ,"
"Tanh Tanh_275 1 1 479 480 ,"
"StridedSliceV2 Slice_276 1 1 452 481 1 4 1 8 1 1 1 1 ,"
"InnerProduct Gemm_277 1 1 481 482 3 1 0 1 ,"
"Tanh Tanh_278 1 1 482 483 ,"
"StridedSliceV2 Slice_279 1 1 452 484 1 8 1 2147483647 1 1 1 1 ,"
"InnerProduct Gemm_280 1 1 484 485 9 1 0 1 ,"
"ReLU Relu_281 1 1 485 486 ,"
"Reshape Reshape_287 1 1 486 496 0 3 3 0 3 3 0 ,"
"StridedSliceV2 Slice_288 1 1 458 497 1 0 1 4 1 1 1 1 ,"
"InnerProduct Gemm_289 1 1 497 498 3 1 0 1 ,"
"Tanh Tanh_290 1 1 498 499 ,"
"StridedSliceV2 Slice_291 1 1 458 500 1 4 1 8 1 1 1 1 ,"
"InnerProduct Gemm_292 1 1 500 501 3 1 0 1 ,"
"Tanh Tanh_293 1 1 501 502 ,"
"StridedSliceV2 Slice_294 1 1 458 503 1 8 1 2147483647 1 1 1 1 ,"
"InnerProduct Gemm_295 1 1 503 504 9 1 0 1 ,"
"ReLU Relu_296 1 1 504 505 ,"
"Reshape Reshape_302 1 1 505 515 0 3 3 0 3 3 0 ,"
"Add Add_304 1 1 461 517 1 ,"
"Gather Gather_306 1 1 477 519 2 0 1 ,"
"Mul Mul_307 2 1 517 519 520 1 ,"
"Gather Gather_309 1 1 477 522 2 0 1 ,"
"Mul Mul_310 2 1 461 522 523 1 ,"
"Add Add_311 2 1 520 523 524 1 ,"
"Add Add_313 1 1 461 526 1 ,"
"Gather Gather_315 1 1 477 528 2 0 1 ,"
"Mul Mul_316 2 1 526 528 529 1 ,"
"Add Add_317 2 1 524 529 530 1 ,"
"Add Add_319 1 1 464 532 1 ,"
"Mul Mul_321 1 1 532 534 1 ,"
"Div Div_322 2 1 530 534 535 1 ,"
"Add Add_324 1 1 480 537 1 ,"
"Gather Gather_326 1 1 496 539 2 0 1 ,"
"Mul Mul_327 2 1 537 539 540 1 ,"
"Gather Gather_329 1 1 496 542 2 0 1 ,"
"Mul Mul_330 2 1 480 542 543 1 ,"
"Add Add_331 2 1 540 543 544 1 ,"
"Add Add_333 1 1 480 546 1 ,"
"Gather Gather_335 1 1 496 548 2 0 1 ,"
"Mul Mul_336 2 1 546 548 549 1 ,"
"Add Add_337 2 1 544 549 550 1 ,"
"Add Add_339 1 1 464 552 1 ,"
"Mul Mul_341 1 1 552 554 1 ,"
"Div Div_342 2 1 550 554 555 1 ,"
"Add Add_344 1 1 483 557 1 ,"
"Mul Mul_346 1 1 557 559 1 ,"
"Div Div_347 2 1 555 559 560 1 ,"
"Add Add_349 1 1 499 562 1 ,"
"Gather Gather_351 1 1 515 564 2 0 1 ,"
"Mul Mul_352 2 1 562 564 565 1 ,"
"Gather Gather_354 1 1 515 567 2 0 1 ,"
"Mul Mul_355 2 1 499 567 568 1 ,"
"Add Add_356 2 1 565 568 569 1 ,"
"Add Add_358 1 1 499 571 1 ,"
"Gather Gather_360 1 1 515 573 2 0 1 ,"
"Mul Mul_361 2 1 571 573 574 1 ,"
"Add Add_362 2 1 569 574 575 1 ,"
"Add Add_364 1 1 464 577 1 ,"
"Mul Mul_366 1 1 577 579 1 ,"
"Div Div_367 2 1 575 579 580 1 ,"
"Add Add_369 1 1 483 582 1 ,"
"Mul Mul_371 1 1 582 584 1 ,"
"Div Div_372 2 1 580 584 585 1 ,"
"Add Add_374 1 1 502 587 1 ,"
"Mul Mul_376 1 1 587 589 1 ,"
"Div Div_377 2 1 585 589 590 1 ,"
"Add Add_378 2 1 535 560 591 1 ,"
"Add Add_379 2 1 591 590 592 1 ,"
"Mul Mul_381 1 1 592 output 1 ,"
